In [24]:
import pandas as pd

# Checking Statistical summary of all the datasets

# # Main Data

In [2]:
df = pd.read_csv("C:/Users/Dell/Desktop/25 march/studentVle.csv")

In [25]:
df1 = pd.read_csv("C:/Users/Dell/Desktop/25 march/Vle.csv")
df2 = pd.read_csv("C:/Users/Dell/Desktop/25 march/studentRegistration.csv")
df3 = pd.read_csv("C:/Users/Dell/Desktop/25 march/studentInfo.csv")
df4 = pd.read_csv("C:/Users/Dell/Desktop/25 march/courses.csv")
df5 = pd.read_csv("C:/Users/Dell/Desktop/25 march/assessments.csv")

In [3]:
df.describe

<bound method NDFrame.describe of          code_module code_presentation  id_student  id_site  date  sum_click
0                AAA             2013J       28400   546652   -10          4
1                AAA             2013J       28400   546652   -10          1
2                AAA             2013J       28400   546652   -10          1
3                AAA             2013J       28400   546614   -10         11
4                AAA             2013J       28400   546714   -10          1
...              ...               ...         ...      ...   ...        ...
10655275         GGG             2014J      675811   896943   269          3
10655276         GGG             2014J      675578   896943   269          1
10655277         GGG             2014J      654064   896943   269          3
10655278         GGG             2014J      654064   896939   269          1
10655279         GGG             2014J      654064   896939   269          1

[10655280 rows x 6 columns]>

In [7]:
df.isnull().sum()

code_module          0
code_presentation    0
id_student           0
id_site              0
date                 0
sum_click            0
dtype: int64

In [8]:
blank_spaces = (df == ' ')
blank_spaces_count = blank_spaces.sum()
print(blank_spaces_count)

code_module          0
code_presentation    0
id_student           0
id_site              0
date                 0
sum_click            0
dtype: int64

In [ ]:
 ## This shows that there is no null spaces and blank spaces in the main dataset.

In [9]:
df.describe()

         id_student       id_site          date     sum_click
count  1.065528e+07  1.065528e+07  1.065528e+07  1.065528e+07
mean   7.333336e+05  7.383234e+05  9.517400e+01  3.716946e+00
std    5.827060e+05  1.312196e+05  7.607130e+01  8.849047e+00
min    6.516000e+03  5.267210e+05 -2.500000e+01  1.000000e+00
25%    5.077430e+05  6.735190e+05  2.500000e+01  1.000000e+00
50%    5.882360e+05  7.300690e+05  8.600000e+01  2.000000e+00
75%    6.464840e+05  8.770300e+05  1.560000e+02  3.000000e+00
max    2.698588e+06  1.049562e+06  2.690000e+02  6.977000e+03

In [12]:
df.columns

Index(['code_module', 'code_presentation', 'id_student', 'id_site', 'date',
       'sum_click'],
      dtype='object')

# DATASET - 2

In [20]:
df1.describe

<bound method NDFrame.describe of       id_site code_module code_presentation activity_type  week_from  week_to
0      546943         AAA             2013J      resource        NaN      NaN
1      546712         AAA             2013J     oucontent        NaN      NaN
2      546998         AAA             2013J      resource        NaN      NaN
3      546888         AAA             2013J           url        NaN      NaN
4      547035         AAA             2013J      resource        NaN      NaN
...       ...         ...               ...           ...        ...      ...
6359   897063         GGG             2014J      resource        NaN      NaN
6360   897109         GGG             2014J      resource        NaN      NaN
6361   896965         GGG             2014J     oucontent        NaN      NaN
6362   897060         GGG             2014J      resource        NaN      NaN
6363   897100         GGG             2014J      resource        NaN      NaN

[6364 rows x 6 columns]>

In [32]:
df1.isnull().sum()

id_site                 0
code_module             0
code_presentation       0
activity_type           0
week_from            5243
week_to              5243
dtype: int64

In [33]:
df1.describe()

            id_site    week_from      week_to
count  6.364000e+03  1121.000000  1121.000000
mean   7.260991e+05    15.204282    15.214987
std    1.283151e+05     8.792865     8.779806
min    5.267210e+05     0.000000     0.000000
25%    6.615928e+05     8.000000     8.000000
50%    7.300965e+05    15.000000    15.000000
75%    8.140162e+05    22.000000    22.000000
max    1.077905e+06    29.000000    29.000000

# DATASET - 3

In [23]:
df2.describe

<bound method NDFrame.describe of       code_module code_presentation  id_student  date_registration  \
0             AAA             2013J       11391             -159.0
1             AAA             2013J       28400              -53.0
2             AAA             2013J       30268              -92.0
3             AAA             2013J       31604              -52.0
4             AAA             2013J       32885             -176.0
...           ...               ...         ...                ...
32588         GGG             2014J     2640965               -4.0
32589         GGG             2014J     2645731              -23.0
32590         GGG             2014J     2648187             -129.0
32591         GGG             2014J     2679821              -49.0
32592         GGG             2014J     2684003              -28.0

       date_unregistration
0                      NaN
1                      NaN
2                     12.0
3                      NaN
4                      NaN
...                    ...
32588                  NaN
32589                  NaN
32590                  NaN
32591                101.0
32592                  NaN

[32593 rows x 5 columns]>

In [31]:
df2.isnull().sum()

code_module                0
code_presentation          0
id_student                 0
date_registration         45
date_unregistration    22521
dtype: int64

In [36]:
df2.describe()

         id_student  date_registration  date_unregistration
count  3.259300e+04       32548.000000         10072.000000
mean   7.066877e+05         -69.411300            49.757645
std    5.491673e+05          49.260522            82.460890
min    3.733000e+03        -322.000000          -365.000000
25%    5.085730e+05        -100.000000            -2.000000
50%    5.903100e+05         -57.000000            27.000000
75%    6.444530e+05         -29.000000           109.000000
max    2.716795e+06         167.000000           444.000000

# DATASET - 4

In [37]:
df3.describe

<bound method NDFrame.describe of       code_module code_presentation  id_student gender                region  \
0             AAA             2013J       11391      M   East Anglian Region
1             AAA             2013J       28400      F              Scotland
2             AAA             2013J       30268      F  North Western Region
3             AAA             2013J       31604      F     South East Region
4             AAA             2013J       32885      F  West Midlands Region
...           ...               ...         ...    ...                   ...
32588         GGG             2014J     2640965      F                 Wales
32589         GGG             2014J     2645731      F   East Anglian Region
32590         GGG             2014J     2648187      F          South Region
32591         GGG             2014J     2679821      F     South East Region
32592         GGG             2014J     2684003      F      Yorkshire Region

           highest_education imd_band age_band  num_of_prev_attempts  \
0           HE Qualification  90-100%     55<=                     0
1           HE Qualification   20-30%    35-55                     0
2      A Level or Equivalent   30-40%    35-55                     0
3      A Level or Equivalent   50-60%    35-55                     0
4         Lower Than A Level   50-60%     0-35                     0
...                      ...      ...      ...                   ...
32588     Lower Than A Level    10-20     0-35                     0
32589     Lower Than A Level   40-50%    35-55                     0
32590  A Level or Equivalent   20-30%     0-35                     0
32591     Lower Than A Level  90-100%    35-55                     0
32592       HE Qualification   50-60%    35-55                     0

       studied_credits disability final_result
0                  240          N         Pass
1                   60          N         Pass
2                   60          Y    Withdrawn
3                   60          N         Pass
4                   60          N         Pass
...                ...        ...          ...
32588               30          N         Fail
32589               30          N  Distinction
32590               30          Y         Pass
32591               30          N    Withdrawn
32592               30          N  Distinction

[32593 rows x 12 columns]>

In [39]:
df3.isnull().sum()

code_module                0
code_presentation          0
id_student                 0
gender                     0
region                     0
highest_education          0
imd_band                1111
age_band                   0
num_of_prev_attempts       0
studied_credits            0
disability                 0
final_result               0
dtype: int64

In [40]:
df3.describe()

         id_student  num_of_prev_attempts  studied_credits
count  3.259300e+04          32593.000000     32593.000000
mean   7.066877e+05              0.163225        79.758691
std    5.491673e+05              0.479758        41.071900
min    3.733000e+03              0.000000        30.000000
25%    5.085730e+05              0.000000        60.000000
50%    5.903100e+05              0.000000        60.000000
75%    6.444530e+05              0.000000       120.000000
max    2.716795e+06              6.000000       655.000000

# DATASET - 5

In [41]:
df4.describe

<bound method NDFrame.describe of    code_module code_presentation  module_presentation_length
0          AAA             2013J                         268
1          AAA             2014J                         269
2          BBB             2013J                         268
3          BBB             2014J                         262
4          BBB             2013B                         240
5          BBB             2014B                         234
6          CCC             2014J                         269
7          CCC             2014B                         241
8          DDD             2013J                         261
9          DDD             2014J                         262
10         DDD             2013B                         240
11         DDD             2014B                         241
12         EEE             2013J                         268
13         EEE             2014J                         269
14         EEE             2014B                         241
15         FFF             2013J                         268
16         FFF             2014J                         269
17         FFF             2013B                         240
18         FFF             2014B                         241
19         GGG             2013J                         261
20         GGG             2014J                         269
21         GGG             2014B                         241>

In [42]:
df4.isnull().sum()

code_module                   0
code_presentation             0
module_presentation_length    0
dtype: int64

# DATASET - 6

In [19]:
df5.describe

<bound method NDFrame.describe of     code_module code_presentation  id_assessment assessment_type   date  \
0           AAA             2013J           1752             TMA   19.0
1           AAA             2013J           1753             TMA   54.0
2           AAA             2013J           1754             TMA  117.0
3           AAA             2013J           1755             TMA  166.0
4           AAA             2013J           1756             TMA  215.0
..          ...               ...            ...             ...    ...
201         GGG             2014J          37443             CMA  229.0
202         GGG             2014J          37435             TMA   61.0
203         GGG             2014J          37436             TMA  124.0
204         GGG             2014J          37437             TMA  173.0
205         GGG             2014J          37444            Exam  229.0

     weight
0      10.0
1      20.0
2      20.0
3      20.0
4      30.0
..      ...
201     0.0
202     0.0
203     0.0
204     0.0
205   100.0

[206 rows x 6 columns]>

In [44]:
df5.isnull().sum()

code_module           0
code_presentation     0
id_assessment         0
assessment_type       0
date                 11
weight                0
dtype: int64

# CONCLUSION:

In [ ]:
# In main dataset there is no null values but its corresponding datasets have them.
# In dataset no. 2 week_from - week_to there are EQUAL number of missing values.
# WHereas there is a huge data entries missing in column date_unregistered showing that there is no clarity in the same.
# In dataset 4 and 6 there are 1 column each having missing values.